NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG21/EFR32BG21B020F1024IM32.svd
        <register>
          <name>CTRL0</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDM0DIFFDIS</name>
              <description>Frame Detection Mode 0 disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAPFSK</name>
              <description>Mapping of FSK symbols</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAP0</name>
                  <description>4FSK: Symbol 11, 10, 00, 01 for decreasing frequency. 2FSK/MSK/ASK/OOK: Symbol 1 is high/positive frequency or high amplitude, symbol 0 is low/negative frequency or low amplitude.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAP1</name>
                  <description>4FSK: Symbol 01, 00, 10, 11 for decreasing frequency. 2FSK/MSK/ASK/OOK: Symbol 0 is high/negative frequency or high amplitude, symbol 1 is low/negative frequency or low amplitude.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAP2</name>
                  <description>4FSK: Symbol 10, 11, 01, 00 for decreasing frequency. 2FSK/MSK/ASK/OOK: Undefined.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAP3</name>
                  <description>4FSK: Symbol 00, 01, 11, 10 for decreasing frequency. 2FSK/MSK/ASK/OOK: Undefined.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAP4</name>
                  <description>4FSK: Symbol 11, 01, 00, 10 for decreasing frequency. 2FSK/MSK/ASK/OOK: Undefined.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAP5</name>
                  <description>4FSK: Symbol 10, 00, 01, 11 for decreasing frequency. 2FSK/MSK/ASK/OOK: Undefined.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAP6</name>
                  <description>4FSK: Symbol 01, 11, 10, 00 for decreasing frequency. 2FSK/MSK/ASK/OOK: Undefined.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAP7</name>
                  <description>4FSK: Symbol 00, 10, 11, 01 for decreasing frequency. 2FSK/MSK/ASK/OOK: Undefined.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CODING</name>
              <description>Symbol coding</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NRZ</name>
                  <description>Non Return to Zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MANCHESTER</name>
                  <description>Manchester Coding</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSSS</name>
                  <description>Direct Sequence Spread Spectrum</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINECODE</name>
                  <description>Line code. Maps 0 to 0011 symbol and 1 to 1100 symbols</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODFORMAT</name>
              <description>Modulation format</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSK2</name>
                  <description>Frequency Shift Keying with 2 symbols</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSK4</name>
                  <description>Frequency Shift Keying with 4 symbols</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPSK</name>
                  <description>Binary Phase Shift Keying</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBPSK</name>
                  <description>Differentially encoded Binary Phase Shift Keying</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OQPSK</name>
                  <description>Half Sine Shaped Offset Quadrature Phase Shift Keying</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSK</name>
                  <description>Minimum Shift Keying</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OOKASK</name>
                  <description>On Off Keying and Amplitude Shift Keying</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DUALCORROPTDIS</name>
              <description>Dual Correlation Optimization Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OOKASYNCPIN</name>
              <description>OOK asynchronous pin mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSSSLEN</name>
              <description>DSSS length</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSSSSHIFTS</name>
              <description>DSSS shifts</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOSHIFT</name>
                  <description>No symbols are defined by shifting.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFT1</name>
                  <description>Next symbol generated by 1 cyclic shift.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFT2</name>
                  <description>Next symbol generated by 2 cyclic shifts.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFT4</name>
                  <description>Next symbol generated by 4 cyclic shifts.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFT8</name>
                  <description>Next symbol generated by 8 cyclic shifts.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFT16</name>
                  <description>Next symbol generated by 16 cyclic shifts.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSSSDOUBLE</name>
              <description>DSSS double</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Doubling is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Doubling is enabled by using inverted symbols.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONJ</name>
                  <description>Doubling is enabled by using complex conjugated symbols.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DETDIS</name>
              <description>Detection disable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIFFENCMODE</name>
              <description>Differential encoding mode</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Differential Encoding is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RR0</name>
                  <description>Transmit the XOR-ed value of the Raw symbol and the last Raw symbol. Initial Raw symbol is 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RE0</name>
                  <description>Transmit the XOR-ed value of the Raw symbol and the last Encoded symbol. Initial Encoded symbol is 0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RR1</name>
                  <description>Transmit the XOR-ed value of the Raw symbol and the last Raw symbol. Initial Raw symbol is 1.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RE1</name>
                  <description>Transmit the XOR-ed value of the Raw symbol and the last Encoded symbol. Initial Encoded symbol is 1.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAPING</name>
              <description>Shaping filter</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Filter disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODDLENGTH</name>
                  <description>Filter has odd length. Filter uses coefficients 0,1,2,3,4,5,6,7,8,7,6,5,4,3,2,1,0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENLENGTH</name>
                  <description>Filter has even length. Filter uses coefficients 0,1,2,3,4,5,6,7,7,6,5,4,3,2,1,0.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASYMMETRIC</name>
                  <description>Filter has asymmetrical coefficients. Filter uses coefficients 0,1,2,3,4,5,6,7.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEMODRAWDATASEL</name>
              <description>Demod raw data select</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENTROPY</name>
                  <description>1-bit entropy source extracted from the RF receive chain, to be used for random number generation.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>2 * 3-bit I and Q ADC data.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTLSB</name>
                  <description>2 * 16-bit I and Q channel filtered data downmixed to zero-IF. The receive signal chain has 19 bits dynamic range at this point,   and the FILTLSB setting outputs the 16 least significant bits (with saturation).</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTMSB</name>
                  <description>2 * 16-bit I and Q channel filtered data downmixed to zero-IF. The receive signal chain has 19 bits dynamic range at this point,   and the FILTMSB setting outputs the 16 most significant bits (with truncation).</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTFULL</name>
                  <description>2 * 19-bit I and Q channel filtered data downmixed to zero-IF. The FILTFULL option will output all 19 bits of dynamic range,   sign extended to 32 bits.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQ</name>
                  <description>8-bit received frequency data (or logarithmic amplitude for ASK/OOK).</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEMOD</name>
                  <description>8-bit demodulated data (freq/amp/phase). When coherent detection is enabled, only the in-phase component is selected.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRAMEDETDEL</name>
              <description>FRAMEDET delay</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEL0</name>
                  <description>No delay</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEL8</name>
                  <description>8 baud delay</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEL16</name>
                  <description>16 baud delay</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEL32</name>
                  <description>32 baud delay</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <description>No Description</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFDFFF</resetMask>
          <fields>
            <field>
              <name>SYNCBITS</name>
              <description>Number of sync-word bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCERRORS</name>
              <description>Maximum number of sync errors</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUALSYNC</name>
              <description>Dual sync words.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Demodulator only searches for SYNC0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Demodulator searches for SYNC0 and SYNC1 in parallel.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXSYNC</name>
              <description>Transmit sync word.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNC0</name>
                  <description>Modulator transmits SYNC0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC1</name>
                  <description>Modulator transmits SYNC1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCDATA</name>
              <description>Sync data.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>SYNC is not part of transmit payload. Modulator adds SYNC in transmit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>SYNC is part of transmit payload. Modulator does not add SYNC in transmit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNC1INV</name>
              <description>SYNC1 invert.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COMPMODE</name>
              <description>Compensation mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Compensation is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRELOCK</name>
                  <description>Compensation locks when preamble is detected.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRAMELOCK</name>
                  <description>Compensation locks when frame is detected.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOLOCK</name>
                  <description>Compensation is always running</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESYNCPER</name>
              <description>Resync period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHASEDEMOD</name>
              <description>Phase demodulation</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BDD</name>
                  <description>Bit Differential Detection.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBDD</name>
                  <description>Multibit Differential Detection.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COH</name>
                  <description>Coherent Detection.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREQOFFESTPER</name>
              <description>Frequency offset estimation period</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQOFFESTLIM</name>
              <description>Frequency offset limit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
