NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32BG21/EFR32BG21B020F1024IM32.svd
      </registers>
    </peripheral>
  </peripherals>
  <vendorExtensions>
    <name>Copyright 2018 Silicon Laboratories, Inc.</name>
    <flashBaseAddress>0x00000000</flashBaseAddress>
    <flashSize>0x00100000</flashSize>
    <flashAccessTypes>rx</flashAccessTypes>
    <userdataBaseAddress>0x0FE00000</userdataBaseAddress>
    <userdataSize>0x00000400</userdataSize>
    <userdataAccessTypes>rx</userdataAccessTypes>
    <devinfoBaseAddress>0x0FE08000</devinfoBaseAddress>
    <devinfoSize>0x00000400</devinfoSize>
    <devinfoAccessTypes>rx</devinfoAccessTypes>
    <chipconfigBaseAddress>0x0FE0E000</chipconfigBaseAddress>
    <chipconfigSize>0x00000400</chipconfigSize>
    <chipconfigAccessTypes>rx</chipconfigAccessTypes>
    <reservedBaseAddress>0x0FF00000</reservedBaseAddress>
    <reservedSize>0x00100000</reservedSize>
    <reservedAccessTypes>rx</reservedAccessTypes>
    <ramBaseAddress>0x20000000</ramBaseAddress>
    <ramSize>0x00018000</ramSize>
    <ramAccessTypes>rwx</ramAccessTypes>
    <seqram_s_BaseAddress>0xA0000000</seqram_s_BaseAddress>
    <seqram_s_Size>0x00002000</seqram_s_Size>
    <seqram_s_AccessTypes>rwx</seqram_s_AccessTypes>
    <frcram_s_BaseAddress>0xA0002000</frcram_s_BaseAddress>
    <frcram_s_Size>0x00001000</frcram_s_Size>
    <frcram_s_AccessTypes>rwx</frcram_s_AccessTypes>
    <seqram_ns_BaseAddress>0xB0000000</seqram_ns_BaseAddress>
    <seqram_ns_Size>0x00002000</seqram_ns_Size>
    <seqram_ns_AccessTypes>rwx</seqram_ns_AccessTypes>
    <frcram_ns_BaseAddress>0xB0002000</frcram_ns_BaseAddress>
    <frcram_ns_Size>0x00001000</frcram_ns_Size>
    <frcram_ns_AccessTypes>rwx</frcram_ns_AccessTypes>
  </vendorExtensions>
</device>
